Repository: linkoln-1/mac-dynamic-island
Catalog: Shared/Localization/Localizable.xcstrings
Source language: en
Languages: ru

# module.screenshots.title
source: Screenshot Buffer
ru: Буфер скриншотов

# module.nowPlaying.title
source: Now Playing
ru: Сейчас играет

# module.agents.title
source: AI Agents
ru: AI-агенты

# module.attention.title
source: Attention
ru: Внимание

# agent.state.idle
source: Idle
ru: Ожидание

# agent.state.working
source: Working
ru: Выполняется

# agent.state.needsPermission
source: Needs permission
ru: Требуется разрешение

# agent.state.finished
source: Finished
ru: Завершено

# agent.state.failed
source: Failed
ru: Ошибка

# agent.state.stale
source: No recent activity
ru: Нет активности

# agent.setup.description
source: Monitor Claude Code and Codex sessions in real time.
ru: Мониторинг сессий Claude Code и Codex в реальном времени.

# agent.setup.enable
source: Enable Agent Monitoring
ru: Включить мониторинг агентов

# agent.empty
source: No agent sessions yet. Start Claude Code or Codex — sessions appear here.
ru: Сессий агентов пока нет. Запустите Claude Code или Codex — они появятся здесь.

# agent.empty.provider
source: No %@ sessions.
ru: Нет сессий %@.

# agent.empty.any
source: No agent sessions.
ru: Нет сессий агентов.

# agent.tab.all
source: All
ru: Все

# agent.tab.allProviders
source: All providers
ru: Все провайдеры

# agent.clear
source: Clear
ru: Очистить

# agent.clear.help
source: Remove finished and idle sessions
ru: Убрать завершённые и неактивные сессии

# agent.repair
source: Repair
ru: Починить

# agent.sessions.count
source: %lld sessions
ru: %lld сессии

# agent.subagents.count
source: %lld subagents
ru: %lld субагента

# agent.actions.help
source: Project actions
ru: Действия с проектом

# action.openProject
source: Open Project
ru: Открыть проект

# action.revealInFinder
source: Reveal in Finder
ru: Показать в Finder

# action.copyProjectPath
source: Copy Project Path
ru: Скопировать путь к проекту

# agent.activity.working
source: Working
ru: Работает

# agent.activity.thinking
source: Thinking…
ru: Думает…

# agent.activity.reading
source: Reading %@
ru: Читает %@

# agent.activity.readingFiles
source: Reading files
ru: Читает файлы

# agent.activity.editing
source: Editing %@
ru: Изменяет %@

# agent.activity.editingFiles
source: Editing files
ru: Изменяет файлы

# agent.activity.writing
source: Writing %@
ru: Пишет %@

# agent.activity.writingFiles
source: Writing files
ru: Пишет файлы

# agent.activity.running
source: Running %@
ru: Выполняет %@

# agent.activity.runningCommand
source: Running a command
ru: Выполняет команду

# agent.activity.searching
source: Searching
ru: Ищет

# agent.activity.fetching
source: Fetching a page
ru: Загружает страницу

# agent.activity.subagent
source: Working with subagent
ru: Работает с субагентом

# agent.activity.mcp
source: Using MCP tool
ru: Использует MCP-инструмент

# agent.activity.using
source: Using %@
ru: Использует %@

# agent.activity.waitingPermission
source: Waiting for your permission
ru: Ожидает вашего разрешения

# agent.failure.rateLimit
source: rate limit
ru: лимит запросов

# agent.failure.authentication
source: authentication
ru: ошибка авторизации

# agent.failure.network
source: network error
ru: ошибка сети

# agent.failure.server
source: server error
ru: ошибка сервера

# agent.failure.generic
source: error
ru: ошибка

# attention.filter.unread
source: Unread
ru: Непрочитанные

# attention.filter.all
source: All
ru: Все

# attention.unread.count
source: %lld unread
ru: %lld непрочитанных

# attention.clearRead
source: Clear Read
ru: Очистить прочитанные

# attention.empty.allClear
source: All clear
ru: Всё спокойно

# attention.empty.noSources
source: No attention sources enabled
ru: Источники уведомлений не включены

# attention.action.markRead
source: Mark as Read
ru: Отметить как прочитанное

# attention.action.dismiss
source: Dismiss
ru: Скрыть

# attention.detail.finished
source: Finished
ru: Завершено

# attention.detail.finishedIn
source: Finished in %@
ru: Завершено за %@

# attention.badge.help
source: Needs your attention
ru: Требуется ваше внимание

# screenshots.selected
source: Selected: %lld
ru: Выбрано: %lld

# screenshots.copy
source: Copy
ru: Скопировать

# screenshots.remove
source: Remove from Buffer
ru: Убрать из буфера

# screenshots.clearSelection
source: Clear Selection
ru: Снять выделение

# screenshots.open
source: Open
ru: Открыть

# screenshots.quickLook
source: Quick Look
ru: Быстрый просмотр

# screenshots.empty
source: Take a screenshot (⌘⇧3 / ⌘⇧4) or copy an image — it appears here.
ru: Сделайте скриншот (⌘⇧3 / ⌘⇧4) или скопируйте изображение — оно появится здесь.

# media.nothingPlaying
source: Nothing Playing
ru: Ничего не играет

# media.previous
source: Previous track
ru: Предыдущий трек

# media.next
source: Next track
ru: Следующий трек

# media.play
source: Play
ru: Воспроизвести

# media.pause
source: Pause
ru: Пауза

# media.progress
source: Playback progress
ru: Прогресс воспроизведения

# menu.openIsland
source: Open Island
ru: Открыть остров

# menu.language
source: Language
ru: Язык

# menu.language.system
source: System
ru: Системный

# menu.settings
source: Settings…
ru: Настройки…

# settings.title
source: PersonalIsland Settings
ru: Настройки PersonalIsland

# settings.empty
source: Nothing to configure yet.
ru: Пока нечего настраивать.

# settings.section.island
source: Island
ru: Остров

# settings.island.hoverOpen
source: Open on hover
ru: Раскрывать при наведении

# settings.island.expandDelay
source: Hover delay
ru: Задержка раскрытия

# settings.island.collapseGrace
source: Close delay
ru: Задержка сворачивания

# settings.section.notifications
source: Agent Notifications
ru: Уведомления агентов

# settings.agents.autoClear
source: Auto-clear finished after
ru: Автоочистка завершённых через

# settings.section.general
source: General
ru: Основные

# settings.launchAtLogin
source: Launch at login
ru: Запускать при входе

# settings.screenshots.limit
source: Buffer size
ru: Размер буфера

# settings.attention.retention
source: Keep history
ru: Хранить историю

# settings.seconds.suffix
source: s
ru: с

# settings.items.count
source: %lld items
ru: %lld элемента

# settings.days.count
source: %lld days
ru: %lld дня

# menu.checkUpdates
source: Check for Updates…
ru: Проверить обновления…

# module.clipboard.title
source: Clipboard
ru: Буфер обмена

# clipboard.kind.text
source: Text
ru: Текст

# clipboard.kind.url
source: Link
ru: Ссылка

# clipboard.kind.code
source: Code
ru: Код

# clipboard.kind.file
source: File
ru: Файл

# clipboard.action.pin
source: Pin
ru: Закрепить

# clipboard.action.unpin
source: Unpin
ru: Открепить

# clipboard.action.delete
source: Delete
ru: Удалить

# clipboard.empty
source: Copy something — it appears here. Password manager entries are never captured.
ru: Скопируйте что-нибудь — оно появится здесь. Записи менеджеров паролей не сохраняются.

# clipboard.copied
source: Copied
ru: Скопировано

# settings.section.modules
source: Sidebar Modules
ru: Модули сайдбара

# settings.modules.moveUp
source: Move up
ru: Выше

# settings.modules.moveDown
source: Move down
ru: Ниже

# onboarding.title
source: Welcome to PersonalIsland
ru: Добро пожаловать в PersonalIsland

# onboarding.hover
source: Move your pointer to the notch — the island opens on hover and closes when you leave.
ru: Наведите курсор на вырез экрана — остров раскроется сам и свернётся, когда вы уйдёте.

# onboarding.modules
source: Five modules live in the sidebar: screenshots, media, AI agents, attention and clipboard history. Reorder them in Settings.
ru: В сайдбаре пять модулей: скриншоты, музыка, AI-агенты, внимание и буфер обмена. Порядок меняется в Настройках.

# onboarding.agents
source: Open the AI Agents module and enable monitoring to watch Claude Code and Codex sessions in real time.
ru: Откройте модуль AI-агентов и включите мониторинг, чтобы видеть сессии Claude Code и Codex в реальном времени.

# onboarding.menubar
source: The ✦ icon in the menu bar holds language, settings and updates.
ru: Иконка ✦ в строке меню — язык, настройки и обновления.

# onboarding.start
source: Get Started
ru: Начать

# agent.action.openApp
source: Open the app running this session
ru: Открыть приложение этой сессии

# menu.quit
source: Quit PersonalIsland
ru: Завершить PersonalIsland

# codex.health.unavailable
source: Codex monitoring unavailable — local session data not found.
ru: Мониторинг Codex недоступен — локальные данные сессий не найдены.

# time.now
source: now
ru: сейчас

# time.minutesAgo
source: %lldm ago
ru: %lld мин назад

# time.hoursAgo
source: %lldh ago
ru: %lld ч назад

# time.daysAgo
source: %lldd ago
ru: %lld дн назад
